# # print(값)
# # print는 파이썬에 기본ㅇ로 들어있는 "내장함수"(집접 만들기 않아도 사용 가능)
# # 괄호 () 안에 넣은 값을 화면(터미널)에 그대로 출력

# # print("안녕하세요") # 안녕하세요 글자 출력
# # print(714) # 714 출력

# # #printsms 한번이 한줄로 출력됨
# # print("첫전째 줄")
# # print("두번째 줄")

# # 글자의 따옴표는 "큰 따옴표", '작은 따음표' 모두 가능
# # 따옴표 혼용은 금지
# # Print("이러ㅎ게 대문자를 쓰는 등 정확하지 않은 코드 작성 시 동작 x")
# # ==================

# # 숫자 출력
# print(1133)
# print(3.14)

# # 숫자를 따옴표로 감쌀 경우 숫자처럼 보이는 글자가 출력됨
# # print(1)과 print("1")은 똑같이 보이지만 다른 결과 출력하고 있는 것
# # ============

# # 실습
# # 오늘 날짜 "숫자"로 출력 714
# # 오늘 날짜 "문자"로 출력 20260714
# # 내 생일 "숫자"로 출력

# print(714)
# print("20260714")
# print(522)

# # 숫자로 출력할 때 0으로 시작하는 숫자는 8진수로 인식되어 오류 발생
# # print(0123) # 이 코드는 오류
# # "0123" 와 같이 문자로 출력

# #===========
# # hello = "안녕하세요"
# # print(hello) # hello라는 변수(이름)이 있다고 생각함
# # 변수가 없다면 NameError: name 'hello' is not
# ========

# 글자와 숫자의 연산
print(123 + 456)
print("123" + "456")

print(5 * 2)
print("5" * 2)
print("5 " * 4)

# 값을 여러개 출력하기

print("온도: , 75")  # 온도: 75 글자와 숫자 한 번에 출력, 쉼표 띄어쓰기로 치환
print("온도: , 75, " "도")
print("설비", 1, "번 상태:", "정상")
# ================
print("온도(℃):", "75")
print("진동(m/s):", "2.3")
# ===========================
print("===", "1번", "측정값", "===")
print("온도(℃):", 75)
print("진동(m/s:)", 2.3)
# ,로 나뉘어진 부분을 띄어쓰기 한 칸이 자동으로 삽입됨.

print("더하기" + "연산자를" + "사용하면", "?")
print("===========실습, 측정값 출력(+사용)============")
print(" 온도(℃): " + "75")
print("진동(m/s): " + "2.3")


# 글자의 따옴표는 "큰따옴표", '작은 따옴표' 가능
# 혼용은 금지
#========================================================
# print('===============================Neme errod 만들기"=====================
#print(manerror manerror)n#man---=========[prinrt ====
