# + : 더하기
# - : 빼기
# * : 곱하기
# / : 나누기

print(7 + 14)  # 21
print(7 - 14)  # -7 (게산 결과가 음수라도 가능하다)
print(7 * 14)  # 98
print(7 / 14)  # 0.5

print(75 + 80 / 2)  # 115.0 (나누기먼저 게산)
print((75 + 80) / 2)  # 괄호로 감싸서 게산 순서 지정
# ==========================================

print("온도 변화량: ", 7)
print("평균 온도 : ", 77.5)
print("두 측정의 합 : ", 7 + 77.5)
# ========================================
print("============실습, 합/차 평균 게산=============")

print("온도 변화량: ", 7)
print("평균 온도 : ", 77.5)
print("두 측정의 합 : ", 7 + 77.5)
